In [2]:
import pandas as pd
import numpy as np

In [3]:
titanic = pd.read_excel('titanic3.xlsx')

In [4]:
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [74]:
# Question_1
print(titanic.shape)
count_allpassenger = 2227
print(count_allpassenger - 1309)

(1309, 14)
918

In [15]:
# Question_2
titanic.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [40]:
# Question_3
titanic[titanic['survived'] == 1].shape

(500, 14)

In [77]:
# Question_4
print("Female:",titanic[titanic['sex'] == 'female'].shape)
print("Male:",titanic[titanic['sex'] == 'male'].shape)

Female: (466, 14)
Male: (843, 14)

In [76]:
# Question_5
print("Female survived:", titanic[(titanic['survived'] == 1) & (titanic['sex'] == 'female')].shape)
print("Male survived:",titanic[(titanic['survived'] == 1) & (titanic['sex'] == 'male')].shape)

Female survived: (339, 14)
Male survived: (161, 14)

In [83]:
# Question_6
print("Age between 14 and 20 :", titanic[(titanic['age'] >= 14) & (titanic['age'] < 20)].shape)
print("Age between 20 and 40 :", titanic[(titanic['age'] >= 20) & (titanic['age'] < 40)].shape)
print("Age between more than 40 :", titanic[titanic['age'] >= 40].shape)

Age between 14 and 20 : (126, 14)
Age between 20 and 40 : (576, 14)
Age between more than 40 : (245, 14)

In [90]:
# Question_7
print("Age between 14 and 20 :", titanic[(titanic['age'] >= 14) & (titanic['age'] < 20) & (titanic['survived'] == 1)].shape)
print("Age between 20 and 40 :", titanic[(titanic['age'] >= 20) & (titanic['age'] < 40) & (titanic['survived'] == 1)].shape)
print("Age between more than 40 :", titanic[(titanic['age'] >= 40) & (titanic['survived'] == 1)].shape)

Age between 14 and 20 : (49, 14)
Age between 20 and 40 : (225, 14)
Age between more than 40 : (96, 14)

In [97]:
print(titanic.columns)
titanic['pclass'].unique()

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

array([1, 2, 3], dtype=int64)

In [156]:
# Question_8_1 
titanic[titanic['pclass'] == 1]['embarked']

0      S
1      S
2      S
3      S
4      S
      ..
318    S
319    C
320    S
321    S
322    C
Name: embarked, Length: 323, dtype: object

In [157]:
# Question_8_2
titanic[titanic['pclass'] == 1]['embarked'].value_counts()

embarked
S    177
C    141
Q      3
Name: count, dtype: int64

In [162]:
# Question_8_3
titanic[titanic['pclass'] == 1]['embarked'].value_counts().idxmax()

'S'

In [181]:
# Question_9
titanic[titanic['name'].str.contains('John')]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
34,1,0,"Borebank, Mr. John James",male,42.0,0,0,110489,26.5500,D22,S,NaN,NaN,"London / Winnipeg, MB"
38,1,0,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,A21,S,NaN,NaN,"Pomeroy, WA"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1180,3,0,"Sage, Mrs. John (Annie Bullen)",female,NaN,1,9,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
1200,3,0,"Simmons, Mr. John",male,NaN,0,0,SOTON/OQ 392082,8.0500,NaN,S,NaN,NaN,NaN
1220,3,0,"Spinner, Mr. Henry John",male,32.0,0,0,STON/OQ. 369943,8.0500,NaN,S,NaN,NaN,NaN
1242,3,0,"Thomas, Mr. John",male,NaN,0,0,2681,6.4375,NaN,C,NaN,NaN,NaN
1263,3,0,"van Billiard, Master. Walter John",male,11.5,1,1,A/5. 851,14.5000,NaN,S,NaN,1.0,NaN

In [206]:
# Question_10   ؟؟؟؟؟؟؟؟؟؟؟؟
titanic[(titanic['pclass'] == 1) & (titanic['ticket'].str.contains('191'))]

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [209]:
# Question_11
titanic['cabin'].unique().shape

(187,)

In [212]:
# Question_11
titanic.survived = titanic.survived.astype(float)

In [213]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(4), int64(3), object(7)
memory usage: 143.3+ KB

Hi